tiagohintz/zclaw/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Size optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# mbedTLS - needed for HTTPS (reduced cert bundle)
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
# CONFIG_MBEDTLS_TLS_SERVER is not set
# CONFIG_MBEDTLS_SSL_RENEGOTIATION is not set
# CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS is not set
# CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS is not set

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Logging (reduced for size)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
# Keep STA/WPA2 path lean on default build target to stay within firmware budget.
# CONFIG_ESP_WIFI_ENABLE_WPA3_SAE is not set
# CONFIG_ESP_WIFI_ENABLE_SAE_PK is not set
# CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT is not set
# CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA is not set
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set

# TCP/IP stack (unused optional features disabled for size)
# CONFIG_LWIP_IPV6 is not set
# CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES is not set

# Watchdog - longer timeout for API calls
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60

# OTA updates
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# GPIO tool safety defaults
CONFIG_ZCLAW_GPIO_MIN_PIN=2
CONFIG_ZCLAW_GPIO_MAX_PIN=10

# BLE provisioning via companion app (fork feature, see docs/FORK.md).
# Adds the NimBLE stack; the image exceeds upstream's 888 KiB default-build
# budget but fits the 1472 KiB OTA app partition.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
